redis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-22 Sun 02:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Redis In Action</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="guozhen" />
</head>
<body>
<div id="content">
<h1 class="title">Redis In Action</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">1. features</a>
<ul>
<li><a href="#orgheadline1">1.1. 主从复制:</a></li>
<li><a href="#orgheadline2">1.2. Transaction Contorl</a></li>
<li><a href="#orgheadline3">1.3. persisted</a></li>
<li><a href="#orgheadline4">1.4. pub/sub</a></li>
<li><a href="#orgheadline7">1.5. firgure out</a>
<ul>
<li><a href="#orgheadline5">1.5.1. <span class="todo TODO">TODO</span> understand lock and isolation level</a></li>
<li><a href="#orgheadline6">1.5.2. <span class="todo TODO">TODO</span> linux copy-on-write concept</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">1</span> features</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 主从复制:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>过程: 当配置好 slave 后,slave 与 master 建立连接,然后发送 sync 命令。无论是第
一次连接还是重新连接,master 都会启动一个后台进程,将数据库快照保存到文件中,同时
master 主进 程会开始收集新的写命令并缓存。后台进程完成写文件后,master 就发送文
件给 slave,slave 将文件保存到硬盘上,再加载到内存中,接着 master 就会把缓存的命
令转发给 slave,后续 master 将收到的写命令发送给 slave。如果 master 同时收到多
个 slave 发来的同步连接命令, master 只会启动一个进程来写数据库镜像,然后发送给
所有的 slave。</li>
<li>setting: slaveof &lt;masterip&gt; &lt;masterport&gt; #add this to the config file</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Transaction Contorl</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>watch and transaction 都是连接内有效的 链接断开watch 和 transaction 都和被清除</li>
<li>optimsitc locking: 大多数是基于数据版本(version)的记录机制实现的。何谓数据版本?即
为数据增 加一个版本标识,在基于数据库表的版本解决方案中,一般是通过为数据库表添
加一个 “version”字段来实现读取出数据时,将此版本号一同读出,之后更新时,对此版本
号加 1。 此时,将提交数据的版本号与数据库表对应记录的当前版本号进行比对,如果提
交的数据版 本号大于数据库表当前版本号,则予以更新,否则认为是过期数据。
使用watch对key加乐观锁</li>
<li>redis 只能保证事务的每 个命令连续执行,但是如果事务中的一个命令失败了,并不回滚
其他命令</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> persisted</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Snapshotting</li>
<li>aof</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> pub/sub</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.5</span> firgure out</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.5.1</span> <span class="todo TODO">TODO</span> understand lock and isolation level</h4>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.5.2</span> <span class="todo TODO">TODO</span> linux copy-on-write concept</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: guozhen</p>
<p class="date">Created: 2016-05-22 Sun 02:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
